In [137]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'data1' : np.random.randn(5), 'data2' : np.random.randn(5),
                  'key1' : ['a', 'a', 'b', 'b', 'a'],'key2' : ['one', 'two', 'one', 'two', 'one']})
df

      data1     data2 key1 key2
0  0.366488 -0.847351    a  one
1  0.556800  0.758500    a  two
2 -0.371955 -1.361358    b  one
3  1.179671  0.203212    b  two
4 -0.530851  0.146186    a  one

In [145]:
gp = df['data1'].groupby(df['key1'])
for i in gp:
    print(i)

('a', 0    0.366488
1    0.556800
4   -0.530851
Name: data1, dtype: float64)
('b', 2   -0.371955
3    1.179671
Name: data1, dtype: float64)

In [142]:
gp.mean()

key1
a    0.130812
b    0.403858
Name: data1, dtype: float64

In [123]:
grouped=df.groupby(df.dtypes,axis=1)
list(grouped)

[(dtype('int64'),    c  d  e
  a  1  2  3
  b  4  5  6)]

In [12]:
grouped

In [13]:
grouped.mean()

key1
a   -0.686640
b    0.397954
Name: data1, dtype: float64

In [34]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one    -0.228847
      two    -1.602226
b     one    -0.482950
      two     1.278858
Name: data1, dtype: float64

In [19]:
means.unstack

<bound method Series.unstack of key1  key2
a     one    -0.228847
      two    -1.602226
b     one    -0.482950
      two     1.278858
Name: data1, dtype: float64>

In [27]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005   -1.602226
            2006   -0.482950
Ohio        2005    0.922128
            2006   -1.023094
Name: data1, dtype: float64

In [35]:
for name, group in df.groupby(['key1']):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  0.565399 -0.112221    a  one
1 -1.602226 -1.558012    a  two
4 -1.023094  0.183472    a  one
b
      data1     data2 key1 key2
2 -0.482950  1.678236    b  one
3  1.278858 -1.603837    b  two

In [43]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print(k1,k2)
    
    print(group)

a one
      data1     data2 key1 key2
0  0.565399 -0.112221    a  one
4 -1.023094  0.183472    a  one
a two
      data1     data2 key1 key2
1 -1.602226 -1.558012    a  two
b one
     data1     data2 key1 key2
2 -0.48295  1.678236    b  one
b two
      data1     data2 key1 key2
3  1.278858 -1.603837    b  two

In [46]:
list(df.groupby(['key1','key2']))

[(('a', 'one'),       data1     data2 key1 key2
  0  0.565399 -0.112221    a  one
  4 -1.023094  0.183472    a  one),
 (('a', 'two'),       data1     data2 key1 key2
  1 -1.602226 -1.558012    a  two),
 (('b', 'one'),      data1     data2 key1 key2
  2 -0.48295  1.678236    b  one),
 (('b', 'two'),       data1     data2 key1 key2
  3  1.278858 -1.603837    b  two)]

In [50]:
list(df.groupby(['key1','key2']))[0][1]

      data1     data2 key1 key2
0  0.565399 -0.112221    a  one
4 -1.023094  0.183472    a  one

In [52]:
dict(list(df.groupby(['key1','key2'])))

{('a', 'one'):       data1     data2 key1 key2
 0  0.565399 -0.112221    a  one
 4 -1.023094  0.183472    a  one, ('a', 'two'):       data1     data2 key1 key2
 1 -1.602226 -1.558012    a  two, ('b', 'one'):      data1     data2 key1 key2
 2 -0.48295  1.678236    b  one, ('b', 'two'):       data1     data2 key1 key2
 3  1.278858 -1.603837    b  two}

In [57]:
dict(list(df.groupby(['key1','key2'])))[('a','one')]

      data1     data2 key1 key2
0  0.565399 -0.112221    a  one
4 -1.023094  0.183472    a  one

In [120]:
grouped=df.groupby(df.dtypes,axis=1)
list(grouped)[0]

(dtype('int64'),    c  d  e
 a  1  2  3
 b  4  5  6)

In [65]:
dict(list(grouped))

{dtype('float64'):       data1     data2
 0  0.565399 -0.112221
 1 -1.602226 -1.558012
 2 -0.482950  1.678236
 3  1.278858 -1.603837
 4 -1.023094  0.183472, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [68]:
dict(list(grouped))[ np.dtype('O')]

  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [114]:
people = pd.DataFrame(np.random.randn(5,5), columns=['a', 'b', 'c', 'd', 'e'],
     index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.ix[2:3, ['b', 'c']] = np.nan # 添加缺失值
people

d:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

               a         b         c         d         e
Joe     1.003516 -0.214888 -1.291211  0.902337 -0.026280
Steve  -0.044506 -0.796808 -1.582544  1.089469  0.395082
Wes    -0.392981       NaN       NaN -1.484024  0.054540
Jim    -0.441627  1.018730 -0.662645 -0.356318  2.766370
Travis -0.032567  1.523410  1.846901  0.662957 -0.808869

In [135]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
     'd': 'blue', 'e': 'red', 'f' : 'orange'}
by_columns=people.groupby(mapping,axis=1)
for i in by_columns:
    print(i)

('blue',                c         d
Joe    -1.291211  0.902337
Steve  -1.582544  1.089469
Wes          NaN -1.484024
Jim    -0.662645 -0.356318
Travis  1.846901  0.662957)
('red',                a         b         e
Joe     1.003516 -0.214888 -0.026280
Steve  -0.044506 -0.796808  0.395082
Wes    -0.392981       NaN  0.054540
Jim    -0.441627  1.018730  2.766370
Travis -0.032567  1.523410 -0.808869)

In [146]:
people = pd.DataFrame(np.random.randn(5, 5),
     columns=['a', 'b', 'c', 'd', 'e'],
     index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.ix[2:3, ['b', 'c']] = np.nan # 添加缺失值
people

d:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.

               a         b         c         d         e
Joe    -0.510409  1.218273  0.470084  0.275425 -0.816569
Steve  -0.104566  0.978974  0.287588  1.802876 -0.757505
Wes    -0.146793       NaN       NaN -0.410806  1.047909
Jim    -0.170334  0.101686  1.964219  1.757856 -1.594533
Travis  0.801900 -0.872249 -0.576737 -1.137452  0.925827

In [148]:
l=[len(x) for x in people.index]
l

[3, 5, 3, 3, 6]

In [150]:
p=people.groupby(l)

In [151]:
p

In [153]:
for i in p:
    print(i)

(3,             a         b         c         d         e
Joe -0.510409  1.218273  0.470084  0.275425 -0.816569
Wes -0.146793       NaN       NaN -0.410806  1.047909
Jim -0.170334  0.101686  1.964219  1.757856 -1.594533)
(5,               a         b         c         d         e
Steve -0.104566  0.978974  0.287588  1.802876 -0.757505)
(6,              a         b         c         d         e
Travis  0.8019 -0.872249 -0.576737 -1.137452  0.925827)

In [154]:
p.count()

   a  b  c  d  e
3  3  2  2  3  3
5  1  1  1  1  1
6  1  1  1  1  1